app/views/assignments/index.html.erb

<script src="http://maxcdn.bootstrapcdn.com/bootstrap/3.3.6/js/bootstrap.min.js"></script>
<% @locations = current_user.locations.includes(shifts: :assignments) %>
---
SELECT "assignments".* FROM "assignments"