app/controllers/assignments_controller.rb

SELECT "assignments".* FROM "assignments"
---
  def index
    redirect_to login_index_path unless session[:username]
    @assignment = Assignment.new
    @assignments = Assignment.all

DELETE FROM "assignments" WHERE "assignments"."id" = $1  [["id", 17]]
---
  def destroy
    @assignment.destroy

SELECT  "assignments".* FROM "assignments" WHERE "assignments"."id" = $1 LIMIT 1  [["id", 17]]
---
    def set_assignment
      @assignment = Assignment.find(params[:id])