app/controllers/locations_controller.rb

INSERT INTO "locations" ("name", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Oshawa"], ["address", "123 Street St."], ["created_at", "2016-02-22 16:58:13.261524"], ["updated_at", "2016-02-22 16:58:13.261524"]]
---
  def create
    @location = Location.new(location_params)

    respond_to do |format|
      if @location.save