app/controllers/workplaces_controller.rb

  def index
    @workplaces = Workplace.all
---
SELECT "workplaces".* FROM "workplaces"

    def set_workplace
      @workplace = Workplace.find(params[:id])
---
SELECT  "workplaces".* FROM "workplaces" WHERE "workplaces"."id" = $1 LIMIT 1  [["id", 33]]